spec/cassettes/BankAccount/_create_payment/is_called_when_the_model_is_updated_with_first_and_second_deposits.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - '*'
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:34 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM5540adaa116611e4a82802a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKBAFRUlEJCglVUlYPAwFQUh0WAVBQT0ISW1tTXF0NBAVVX1cCBFFaUBQbQQACVEBVOQ==
      Content-Length:
      - '1291'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-22T06:06:34.514022Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-22T06:06:34.514024Z",
              "href": "/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA2B8EGLcZnuoE8KlcCJCKxL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:34 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:34 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM558fc278116611e4a4e806429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '497'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-22T06:06:34.514022Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-22T06:06:34.514024Z",
              "href": "/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA2B8EGLcZnuoE8KlcCJCKxL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:34 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL/verifications
    body:
      encoding: UTF-8
      string: '{}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:41 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM55c4ea16116611e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA2B8EGLcZnuoE8KlcCJCKxL"
              },
              "href": "/verifications/BZ2IooRNlt6xyETY81oEvlwZ",
              "created_at": "2014-07-22T06:06:40.957377Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-22T06:06:41.307366Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ2IooRNlt6xyETY81oEvlwZ"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:41 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:41 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM59cf7ffe116611e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '520'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ2IooRNlt6xyETY81oEvlwZ"
              },
              "can_credit": true,
              "created_at": "2014-07-22T06:06:34.514022Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-22T06:06:34.514024Z",
              "href": "/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA2B8EGLcZnuoE8KlcCJCKxL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:41 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ2IooRNlt6xyETY81oEvlwZ
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:42 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM59f8c6fc116611e4a4e806429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA2B8EGLcZnuoE8KlcCJCKxL"
              },
              "href": "/verifications/BZ2IooRNlt6xyETY81oEvlwZ",
              "created_at": "2014-07-22T06:06:40.957377Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-22T06:06:41.307366Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ2IooRNlt6xyETY81oEvlwZ"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:42 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ2IooRNlt6xyETY81oEvlwZ
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA2B8EGLcZnuoE8KlcCJCKxL"},"created_at":"2014-07-22T06:06:40.957377Z","attempts_remaining":3,"updated_at":"2014-07-22T06:06:41.307366Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ2IooRNlt6xyETY81oEvlwZ","amount_1":1,"amount_2":1}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:42 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM5a2fe010116611e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA2B8EGLcZnuoE8KlcCJCKxL"
              },
              "href": "/verifications/BZ2IooRNlt6xyETY81oEvlwZ",
              "created_at": "2014-07-22T06:06:40.957377Z",
              "attempts_remaining": 2,
              "updated_at": "2014-07-22T06:06:42.585356Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ2IooRNlt6xyETY81oEvlwZ"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:42 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:42 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM5a5fd8b0116611e4b7da06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '521'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ2IooRNlt6xyETY81oEvlwZ"
              },
              "can_credit": true,
              "created_at": "2014-07-22T06:06:34.514022Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-22T06:06:42.584350Z",
              "href": "/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA2B8EGLcZnuoE8KlcCJCKxL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:42 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA2B8EGLcZnuoE8KlcCJCKxL/debits
    body:
      encoding: UTF-8
      string: '{"amount":65000,"appears_on_statement_as":"Epicodus Tuition","description":"Some
        descriptive text for the debit in the dashboard"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 22 Jul 2014 06:06:43 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM5a976924116611e4b7da06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP5QvkWSZNZmrJaB6yOYpgrn
      X-Balanced-Merchant:
      - TEST-MR5Q2QtK9j3yyvFcGzZkHp7D
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.90
      Content-Length:
      - '1033'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": "Some descriptive text for the debit in the dashboard",
              "links": {
                "customer": null,
                "source": "BA2B8EGLcZnuoE8KlcCJCKxL",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-07-22T06:06:43.519749Z",
              "created_at": "2014-07-22T06:06:43.265639Z",
              "transaction_number": "W352-449-4433",
              "failure_reason": null,
              "currency": "USD",
              "amount": 65000,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD2KYVt1hmPsUeHb0dzbayep",
              "appears_on_statement_as": "BAL*Epicodus Tuition",
              "id": "WD2KYVt1hmPsUeHb0dzbayep"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.order": "/orders/{debits.order}",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.events": "/debits/{debits.id}/events"
          }
        }
    http_version: 
  recorded_at: Tue, 22 Jul 2014 06:06:43 GMT
recorded_with: VCR 2.9.2
